run/tutorials/combustion/fireFoam/LES/simplePMMApanel/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          false;
    coupled         yes;
    transient       yes;
    cellValueSourceCorrection yes;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            hs              explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1000;
    T0              300;
    Cp0             4187;

    youngsModulus   1e9;
    poissonsRatio   0.35;

    epsilon0        1;
    f0              0.5;
    Pr              0.7;
    Tvap            273;
    Tbp             373;

    constantVolume  false;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }
    injectionModel  reactingLookupTableInjection;

    dragModel       sphereDrag;

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none;

    compositionModel singlePhaseMixture;

    phaseChangeModel none;

    stochasticCollisionModel none;

    postProcessingModel none;

    surfaceFilmModel thermoSurfaceFilm;

    radiation       off;

    reactingLookupTableInjectionCoeffs
    {
        massTotal       1e-1;
        parcelBasisType mass;
        SOI             0.001;
        inputFile       "parcelInjectionProperties";
        duration        20.0;
        parcelsPerSecond 200;
    }

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O          1;
            }
        );
    }

    thermoSurfaceFilmCoeffs
    {
        interactionType splashBai;
        deltaWet        0.0005;
        Adry            2630;
        Awet            1320;
        Cf              0.6;
    }
}


cloudFunctions
{}


// ************************************************************************* //
